[
  {
    "title": "उत्तर प्रदेश - जैविक खेती",
    "description": "पूर्वी UP में धान और सब्जियों की जैविक खेती तेजी से बढ़ रही है। बुंदेलखंड में सूखा-प्रतिरोधी दलहन/तिलहन को जैविक रूप से उगाया जाता है। राज्य सरकार द्वारा जैविक उत्पाद बाजार (Organic Haats) और किसान प्रशिक्षण केंद्र स्थापित किए गए हैं।"
  },
  {
    "title": "बिहार - जैविक खेती",
    "description": "कोसी और मिथिलांचल क्षेत्र में जैविक चावल व मक्का की खेती प्रचलित है। बिहार सरकार 'बायो-फर्टिलाइजर यूनिट्स' और 'सेंद्रिय प्रमाणीकरण' को बढ़ावा दे रही है।"
  },
  {
    "title": "महाराष्ट्र - जैविक खेती",
    "description": "विदर्भ व मराठवाड़ा क्षेत्र में कपास, सोयाबीन और अरहर की जैविक खेती पर ज़ोर। NATURAL FARMING अभियान के तहत ज़ीवामृत और बीजामृत का प्रयोग बढ़ा है।"
  },
  {
    "title": "पंजाब - जैविक खेती",
    "description": "किसानों को धान-गेहूं चक्र से निकालकर जैविक फल-सब्जी व दालों की ओर प्रोत्साहित किया जा रहा है। भूमि सुधार हेतु हरी खाद और वर्मी कम्पोस्ट को अपनाया जा रहा है।"
  },
  {
    "title": "हरियाणा - जैविक खेती",
    "description": "पानीपत, करनाल आदि जिलों में जैविक गेहूं व चना उगाया जाता है।  'हरियाणा जैविक मिशन' के तहत किसानों को सब्सिडी व प्रशिक्षण दिया जा रहा है।"
  },
  {
    "title": "राजस्थान - जैविक खेती",
    "description": "ड्राईलैंड एरिया में बाजरा, मूंगफली, ईसबगोल जैसी फसलों को जैविक तरीकों से उगाया जा रहा है। जल संरक्षण व वर्मी कम्पोस्ट पर विशेष बल दिया गया है।"
  },
  {
    "title": "गुजरात - जैविक खेती",
    "description": "सौराष्ट्र व कच्छ क्षेत्र में जैविक मूंगफली, कपास और गेंहूं। 'गुजरात ऑर्गेनिक मिशन' द्वारा प्रशिक्षण, प्रमाणन और मार्केटिंग सपोर्ट मिल रहा है।"
  },
  {
    "title": "मध्य प्रदेश - जैविक खेती",
    "description": "भारत का 'सर्वाधिक जैविक उत्पादक राज्य'। नीमच, मंदसौर और धार में जैविक गेहूं, मसाले और दलहन का उत्पादन।"
  },
  {
    "title": "छत्तीसगढ़ - जैविक खेती",
    "description": "बस्तर क्षेत्र में लघु अनाज (कोदो, कुटकी) और सब्जियों की जैविक खेती बढ़ रही है। राज्य सरकार ने कई 'जैविक क्लस्टर' बनाये हैं।"
  },
  {
    "title": "झारखंड - जैविक खेती",
    "description": "ट्राइबल किसानों द्वारा पारंपरिक जैविक विधियाँ अपनाई जाती हैं। रांची और लोहरदगा जिलों में जैविक सब्जी व मक्का की खेती।"
  },
  {
    "title": "उत्तराखंड - जैविक खेती",
    "description": "पहाड़ी क्षेत्रों में जैविक हल्दी, अदरक और मंडुवा प्रमुख फसलें हैं। जैविक प्रमाणन व मूल्यवर्धन केंद्रों की स्थापना हो चुकी है।"
  },
  {
    "title": "हिमाचल प्रदेश - जैविक खेती",
    "description": "सेब, अदरक और सब्जियों की जैविक खेती को बढ़ावा दिया गया है। प्राकृतिक खेती-देव भूमि योजना भी चालू है।"
  },
  {
    "title": "दिल्ली - जैविक खेती",
    "description": "शहरी कृषि (Terrace farming) में जैविक तरीके अपनाए जा रहे हैं। निजी संस्थाएं जैविक किचन गार्डनिंग को प्रमोट कर रही हैं।"
  },
  {
    "title": "जम्मू-कश्मीर - जैविक खेती",
    "description": "कश्मीर घाटी में सेब, केसर, अखरोट की जैविक खेती को प्रमोट किया जा रहा है। उच्च मूल्य फसलों पर केंद्रित ऑर्गेनिक प्लान।"
  },
  {
    "title": "लद्दाख - जैविक खेती",
    "description": "ठंडे व मरुस्थलीय क्षेत्र में सीमित फसलों की जैविक खेती – जैसे जौ, मटर, गोभी। ग्रीनहाउस जैविक खेती पर फोकस।"
  },
  {
    "title": "अरुणाचल प्रदेश - जैविक खेती",
    "description": "पहाड़ी क्षेत्रों में शिफ्टिंग खेती से हटकर स्थायी जैविक खेती को बढ़ावा। ऑर्गेनिक अदरक, हल्दी और कीवी प्रसिद्ध।"
  },
  {
    "title": "असम - जैविक खेती",
    "description": "ब्रह्मपुत्र घाटी में जैविक चाय और चावल की खेती प्रचलित। राज्य सरकार द्वारा 'असम जैविक मिशन' लागू।"
  },
  {
    "title": "मेघालय - जैविक खेती",
    "description": "काली मिर्च, अदरक और झूम खेती को जैविक तरीके से सुधारा जा रहा है। NEOG केंद्र सक्रिय हैं।"
  },
  {
    "title": "नगालैंड - जैविक खेती",
    "description": "झूम खेती में सुधार कर जैविक दालें, सब्जियाँ व बागवानी फसलें उगाई जा रही हैं।"
  },
  {
    "title": "मणिपुर - जैविक खेती",
    "description": "जैविक चावल, अदरक और हर्बल पौधों की खेती होती है। स्थानीय स्व-सहायता समूह सक्रिय हैं।"
  },
  {
    "title": "मिजोरम - जैविक खेती",
    "description": "झूम खेती से ऑर्गेनिक हॉर्टिकल्चर की ओर बदलाव। संतरा, अदरक और हर्बल पौधों का ऑर्गेनिक उत्पादन।"
  },
  {
    "title": "त्रिपुरा - जैविक खेती",
    "description": "अनानास और सब्जियों की ऑर्गेनिक खेती। कृषि विभाग के जरिए 'ऑर्गेनिक प्रमोशन जोन' बनाए गए हैं।"
  },
  {
    "title": "सिक्किम - जैविक खेती",
    "description": "भारत का पहला पूर्णतः जैविक राज्य। सभी किसानों द्वारा केवल ऑर्गेनिक खेती की जाती है। अंतरराष्ट्रीय मान्यता प्राप्त मॉडल।"
  },
  {
    "title": "पश्चिम बंगाल - जैविक खेती",
    "description": "सुंदरबन क्षेत्र में जैविक धान व सब्जियाँ। 'बीज बैंक' और जैविक मंडी स्थापित की गई हैं।"
  },
  {
    "title": "ओडिशा - जैविक खेती",
    "description": "कोरापुट, नवरंगपुर में पारंपरिक धान, रागी और दालों की जैविक खेती। 'मिशन शक्ति' योजना के तहत महिला समूहों द्वारा जैविक उत्पाद।"
  },
  {
    "title": "आंध्र प्रदेश - जैविक खेती",
    "description": "ZBNF (Zero Budget Natural Farming) को प्रमुखता दी गई है। गन्ना, मूंगफली, नींबू की जैविक खेती बढ़ रही है।"
  },
  {
    "title": "तेलंगाना - जैविक खेती",
    "description": "Natural farming techniques को बढ़ावा। वारंगल में जैविक कपास और हल्दी के क्लस्टर बनाए गए हैं।"
  },
  {
    "title": "तमिलनाडु - जैविक खेती",
    "description": "जैविक धान, सब्जियाँ और नारियल की खेती। कृषि विभाग द्वारा प्रमाणीकरण व मार्केट लिंकेज में सहयोग।"
  },
  {
    "title": "केरल - जैविक खेती",
    "description": "जैविक मसाले (काली मिर्च, हल्दी), फल (केला, अनानास) की खेती प्रमुख। 'Haritha Kerala Mission' चलाया जा रहा है।"
  },
  {
    "title": "कर्नाटक - जैविक खेती",
    "description": "100+ जैविक गांव बनाए गए हैं। ऑर्गेनिक चावल, मूंगफली, नारियल व सब्जियों की खेती। 'KRRS' समूह बहुत सक्रिय।"
  },
  {
    "title": "गोवा - जैविक खेती",
    "description": "फलों (काजू, आम), सब्जियों की जैविक खेती प्रचलन में है। सरकार प्रमाणीकरण व आउटलेट सुविधा दे रही है।"
  },
  {
    "title": "अंडमान व निकोबार - जैविक खेती",
    "description": "उष्णकटिबंधीय जलवायु में नारियल, सुपारी व मसालों की जैविक खेती। द्वीप पर जैव विविधता का संरक्षण ज़रूरी।"
  },
  {
    "title": "चंडीगढ़ - जैविक खेती",
    "description": "छोटे उद्यानों व छतों पर जैविक किचन गार्डनिंग प्रचलित। प्रशासनिक सपोर्ट के साथ स्थानीय आयोजन।"
  },
  {
    "title": "दादरा नगर हवेली और दमन दीव - जैविक खेती",
    "description": "नारियल, केला, सब्जियों की जैविक खेती धीरे-धीरे बढ़ रही है। ड्रिप सिंचाई और सेंद्रिय खाद पर ज़ोर।"
  },
  {
    "title": "लक्षद्वीप - जैविक खेती",
    "description": "कोरल द्वीप पर जैविक नारियल उत्पादन मुख्य। मिट्टी की उर्वरता बनाए रखने के लिए केवल जैविक तरीका अपनाया जाता है।"
  },
  {
    "title": "पुडुचेरी - जैविक खेती",
    "description": "छोटे क्षेत्र में जैविक धान और सब्जियों की खेती। सरकारी सहायता से सॉइल हेल्थ कार्ड और जैविक प्रशिक्षण।"
  }
]
