[
  {
    "region": "उत्तर प्रदेश",
    "title": "उत्तर प्रदेश - मिट्टी की सेहत",
    "description": "यहाँ गंगा-दोआब की उपजाऊ दोमट मिट्टी है। गन्ना, धान, गेहूं के लिए उपयुक्त। एनपीके संतुलन और जैविक खाद (गोबर, वर्मी कम्पोस्ट) आवश्यक है।"
  },
  {
    "region": "बिहार",
    "title": "बिहार - मिट्टी की सेहत",
    "description": "गंगा के मैदानों में उपजाऊ दोमट मिट्टी है। धान-गेहूं प्रणाली आम है। पानी निकासी और हर 3 साल में परीक्षण जरूरी है।"
  },
  {
    "region": "महाराष्ट्र",
    "title": "महाराष्ट्र - मिट्टी की सेहत",
    "description": "काली मिट्टी (रेगुर) कपास के लिए प्रसिद्ध। सल्फर, जिंक की कमी आम है। जैविक और सूक्ष्म पोषक पूरकता ज़रूरी।"
  },
  {
    "region": "पंजाब",
    "title": "पंजाब - मिट्टी की सेहत",
    "description": "लगातार धान-गेहूं से NPK की भारी कमी हो चुकी है। रोटेशन अपनाएं, जैविक खेती बढ़ाएं।"
  },
  {
    "region": "हरियाणा",
    "title": "हरियाणा - मिट्टी की सेहत",
    "description": "सामान्यतः दोमट मिट्टी। अत्यधिक रसायनों के कारण मिट्टी की जैविक गुणवत्ता घट रही है। सेंद्रिय खेती पर जोर।"
  },
  {
    "region": "राजस्थान",
    "title": "राजस्थान - मिट्टी की सेहत",
    "description": "बालू वाली रेतीली मिट्टी। पानी की भारी कमी। सूक्ष्म पोषक तत्वों व जैविक मल्चिंग आवश्यक।"
  },
  {
    "region": "गुजरात",
    "title": "गुजरात - मिट्टी की सेहत",
    "description": "काली व लाल मिट्टी पाई जाती है। नमक जमा होने की समस्या। सॉइल सल्फर और ऑर्गेनिक कार्बन की कमी।"
  },
  {
    "region": "मध्य प्रदेश",
    "title": "मध्य प्रदेश - मिट्टी की सेहत",
    "description": "काली मिट्टी (कपासी) व लाल मिट्टी दोनों मिलती हैं। दलहनी फसलें मिट्टी सुधार में सहायक।"
  },
  {
    "region": "छत्तीसगढ़",
    "title": "छत्तीसगढ़ - मिट्टी की सेहत",
    "description": "रेड और लेटराइट मिट्टी। कम ऑर्गेनिक मैटर। हरी खाद और जैविक खाद का प्रयोग जरूरी।"
  },
  {
    "region": "झारखंड",
    "title": "झारखंड - मिट्टी की सेहत",
    "description": "खरीद मिट्टी, लाल मिट्टी अधिक। फसल की विविधता व जैविक प्रथाओं को अपनाना लाभकारी।"
  },
  {
    "region": "उत्तराखंड",
    "title": "उत्तराखंड - मिट्टी की सेहत",
    "description": "पहाड़ी इलाकों में भू-स्खलन के कारण टॉपसॉयल लॉस होता है। जैविक खेती को बढ़ावा दिया जा रहा है।"
  },
  {
    "region": "हिमाचल प्रदेश",
    "title": "हिमाचल प्रदेश - मिट्टी की सेहत",
    "description": "अल्कलाइन मिट्टी पाई जाती है। बागवानी के लिए जैविक खाद और वर्मी कम्पोस्ट जरूरी।"
  },
  {
    "region": "दिल्ली",
    "title": "दिल्ली - मिट्टी की सेहत",
    "description": "शहरीकरण के कारण जैविक गुणवत्ता घट रही है। छतों व शहरी बागवानी में जैविक तकनीक अपनाएं।"
  },
  {
    "region": "जम्मू-कश्मीर",
    "title": "जम्मू-कश्मीर - मिट्टी की सेहत",
    "description": "कश्मीर में उपजाऊ दोमट व नमी युक्त मिट्टी, बागवानी फसलों के लिए उपयुक्त। जैविक तत्वों की सिफारिश।"
  },
  {
    "region": "लद्दाख",
    "title": "लद्दाख - मिट्टी की सेहत",
    "description": "ठंडी मरुस्थलीय मिट्टी, कार्बनिक तत्वों की कमी। ग्रीनहाउस और जैविक तरीके उपयोगी।"
  },
  {
    "region": "अरुणाचल प्रदेश",
    "title": "अरुणाचल प्रदेश - मिट्टी की सेहत",
    "description": "लेटराइट व पहाड़ी मिट्टी। शिफ्टिंग खेती के कारण उपजाऊता में गिरावट। रोटेशन व जैविक खाद जरूरी।"
  },
  {
    "region": "असम",
    "title": "असम - मिट्टी की सेहत",
    "description": "अत्यंत उपजाऊ जलोढ़ मिट्टी। बाढ़ के कारण पोषक तत्व लॉस होता है। मल्चिंग उपयोगी।"
  },
  {
    "region": "मेघालय",
    "title": "मेघालय - मिट्टी की सेहत",
    "description": "ज्यादा वर्षा के कारण एसिडिक मिट्टी। लाइमिंग और कंपोस्ट जरूरी।"
  },
  {
    "region": "नगालैंड",
    "title": "नगालैंड - मिट्टी की सेहत",
    "description": "लेटराइट मिट्टी प्रमुख। shifting cultivation की वजह से मिट्टी की थकावट। जैविक उपाय ज़रूरी।"
  },
  {
    "region": "मणिपुर",
    "title": "मणिपुर - मिट्टी की सेहत",
    "description": "खेतों में गाद का जमाव व कटाव। जैविक खाद व मिट्टी ढकाव (mulching) अपनाएं।"
  },
  {
    "region": "मिजोरम",
    "title": "मिजोरम - मिट्टी की सेहत",
    "description": "ज्यादातर पहाड़ी मिट्टी। जैविक तत्वों की भारी कमी। हर वर्ष जैविक खाद का उपयोग जरूरी।"
  },
  {
    "region": "त्रिपुरा",
    "title": "त्रिपुरा - मिट्टी की सेहत",
    "description": "रेतीली व दोमट मिट्टी। गन्ना व सब्जियों के लिए उपयुक्त। नाइट्रोजन की पूर्ति जरूरी।"
  },
  {
    "region": "सिक्किम",
    "title": "सिक्किम - मिट्टी की सेहत",
    "description": "भारत का पहला जैविक राज्य। यहाँ सभी खेती जैविक तरीके से होती है।"
  },
  {
    "region": "पश्चिम बंगाल",
    "title": "पश्चिम बंगाल - मिट्टी की सेहत",
    "description": "गंगा डेल्टा की उपजाऊ मिट्टी। अत्यधिक धान-धान प्रणाली से मिट्टी की थकावट, जैविक उपाय आवश्यक।"
  },
  {
    "region": "ओडिशा",
    "title": "ओडिशा - मिट्टी की सेहत",
    "description": "रेड लेटराइट व बालू मिट्टी। हरित खाद और जैविक तरीका अपनाना लाभदायक।"
  },
  {
    "region": "आंध्र प्रदेश",
    "title": "आंध्र प्रदेश - मिट्टी की सेहत",
    "description": "रेड, ब्लैक और ऑलुवियल मिट्टी। नमी की कमी आम समस्या। प्राकृतिक खेती को बढ़ावा।"
  },
  {
    "region": "तेलंगाना",
    "title": "तेलंगाना - मिट्टी की सेहत",
    "description": "काली मिट्टी में नमी की क्षमता ज्यादा, लेकिन फॉस्फोरस की कमी सामान्य है। जैविक उपचार जरूरी।"
  },
  {
    "region": "तमिलनाडु",
    "title": "तमिलनाडु - मिट्टी की सेहत",
    "description": "अधिकांश क्षेत्रों में जलभराव व खारीपन की समस्या। मृदा परीक्षण व सुधार जरूरी।"
  },
  {
    "region": "केरल",
    "title": "केरल - मिट्टी की सेहत",
    "description": "जलोढ़ व लैटराइट मिट्टी। भारी वर्षा के कारण पोषक तत्व लॉस। जैविक खाद व मल्चिंग जरूरी।"
  },
  {
    "region": "कर्नाटक",
    "title": "कर्नाटक - मिट्टी की सेहत",
    "description": "रेड व ब्लैक मिट्टी। इंटरक्रॉपिंग और ऑर्गेनिक सप्लीमेंट से उर्वरता बनाए रखें।"
  },
  {
    "region": "गोवा",
    "title": "गोवा - मिट्टी की सेहत",
    "description": "लैटराइट मिट्टी और जलभराव की स्थिति। खेतों में जैविक मल्चिंग और ट्रेंचिंग की सिफारिश।"
  },
  {
    "region": "अंडमान व निकोबार",
    "title": "अंडमान व निकोबार - मिट्टी की सेहत",
    "description": "कोस्टल मिट्टी, जैविक खेती का अनुकूल वातावरण। उष्णकटिबंधीय फल व सब्जी की खेती।"
  },
  {
    "region": "चंडीगढ़",
    "title": "चंडीगढ़ - मिट्टी की सेहत",
    "description": "शहरी क्षेत्र होने के बावजूद बागवानी के लिए दोमट मिट्टी। जैविक खेती से गुणवत्ता बनी रहती है।"
  },
  {
    "region": "दादरा नगर हवेली और दमन दीव",
    "title": "दादरा नगर हवेली और दमन दीव - मिट्टी की सेहत",
    "description": "रेतीली और लैटराइट मिट्टी। जलधारण क्षमता कम। जैविक व नमी पकड़ने वाले उपाय जरूरी।"
  },
  {
    "region": "लक्षद्वीप",
    "title": "लक्षद्वीप - मिट्टी की सेहत",
    "description": "कोरल मिट्टी, कम उर्वरक तत्व। नारियल व मछली पालन मुख्य। जैविक प्रयास आवश्यक।"
  },
  {
    "region": "पुडुचेरी",
    "title": "पुडुचेरी - मिट्टी की सेहत",
    "description": "जलोढ़ और तटीय मिट्टी। जलभराव और खारीपन मुख्य चुनौती। जैविक प्रथाओं से सुधार संभव।"
  }
]
